#+title: Winnow
#+author: James Conroy-Finn
#+startup: content

*Winnow*: blow away conflicting Tailwind CSS classes.

A Clojure library for merging Tailwind CSS classes, resolving conflicts by
keeping the last value for each conflict group. Inspired by [[https://github.com/dcastil/tailwind-merge][tailwind-merge]].

** Just Tasks
#+begin_src sh :results output verbatim :exports both
just --list
#+end_src

#+results:
#+begin_example
Available recipes:
    [dev]
    fmt        # Format project files
    lint       # Run lints

    [docs]
    docs       # Generate documentation

    [test]
    bench      # Run benchmarks
    compare    # Compare tailwind-merge-clj conformance
    conform    # Run conformance test suite
    hygiene    # Check for reflection and boxing warnings
    test *args # Run tests
    test-bb    # Run Babashka tests
    test-cljs  # Run ClojureScript tests
#+end_example

